espressif/esp-idf/components/soc/esp32c2/register/soc/uart_reg.h
#define UART_FSM_STATUS_REG(i)          (REG_UART_BASE(i) + 0x6C)
/* UART_ST_UTX_OUT : RO ;bitpos:[7:4] ;default: 4'b0 ; */
/*description: This is the status register of transmitter..*/
#define UART_ST_UTX_OUT    0x0000000F
#define UART_ST_UTX_OUT_M  ((UART_ST_UTX_OUT_V)<<(UART_ST_UTX_OUT_S))
#define UART_ST_UTX_OUT_V  0xF
#define UART_ST_UTX_OUT_S  4
/* UART_ST_URX_OUT : RO ;bitpos:[3:0] ;default: 4'b0 ; */
/*description: This is the status register of receiver..*/
#define UART_ST_URX_OUT    0x0000000F
#define UART_ST_URX_OUT_M  ((UART_ST_URX_OUT_V)<<(UART_ST_URX_OUT_S))
#define UART_ST_URX_OUT_V  0xF
#define UART_ST_URX_OUT_S  0

#define UART_POSPULSE_REG(i)          (REG_UART_BASE(i) + 0x70)
/* UART_POSEDGE_MIN_CNT : RO ;bitpos:[11:0] ;default: 12'hfff ; */
/*description: This register stores the minimal input clock count between two positive edges. I
t is used in boudrate-detect process..*/
#define UART_POSEDGE_MIN_CNT    0x00000FFF
#define UART_POSEDGE_MIN_CNT_M  ((UART_POSEDGE_MIN_CNT_V)<<(UART_POSEDGE_MIN_CNT_S))
#define UART_POSEDGE_MIN_CNT_V  0xFFF
#define UART_POSEDGE_MIN_CNT_S  0

#define UART_NEGPULSE_REG(i)          (REG_UART_BASE(i) + 0x74)
/* UART_NEGEDGE_MIN_CNT : RO ;bitpos:[11:0] ;default: 12'hfff ; */
/*description: This register stores the minimal input clock count between two negative edges. I
t is used in boudrate-detect process..*/
#define UART_NEGEDGE_MIN_CNT    0x00000FFF
#define UART_NEGEDGE_MIN_CNT_M  ((UART_NEGEDGE_MIN_CNT_V)<<(UART_NEGEDGE_MIN_CNT_S))
#define UART_NEGEDGE_MIN_CNT_V  0xFFF
#define UART_NEGEDGE_MIN_CNT_S  0

#define UART_CLK_CONF_REG(i)          (REG_UART_BASE(i) + 0x78)
/* UART_RX_RST_CORE : R/W ;bitpos:[27] ;default: 1'b0 ; */
/*description: Write 1 then write 0 to this bit, reset UART Rx..*/
#define UART_RX_RST_CORE    (BIT(27))
#define UART_RX_RST_CORE_M  (BIT(27))
#define UART_RX_RST_CORE_V  0x1
#define UART_RX_RST_CORE_S  27
/* UART_TX_RST_CORE : R/W ;bitpos:[26] ;default: 1'b0 ; */
/*description: Write 1 then write 0 to this bit, reset UART Tx..*/
#define UART_TX_RST_CORE    (BIT(26))
#define UART_TX_RST_CORE_M  (BIT(26))
#define UART_TX_RST_CORE_V  0x1
#define UART_TX_RST_CORE_S  26
/* UART_RX_SCLK_EN : R/W ;bitpos:[25] ;default: 1'b1 ; */
/*description: Set this bit to enable UART Rx clock..*/
#define UART_RX_SCLK_EN    (BIT(25))
#define UART_RX_SCLK_EN_M  (BIT(25))
#define UART_RX_SCLK_EN_V  0x1
#define UART_RX_SCLK_EN_S  25
/* UART_TX_SCLK_EN : R/W ;bitpos:[24] ;default: 1'b1 ; */
/*description: Set this bit to enable UART Tx clock..*/
#define UART_TX_SCLK_EN    (BIT(24))
#define UART_TX_SCLK_EN_M  (BIT(24))
#define UART_TX_SCLK_EN_V  0x1
#define UART_TX_SCLK_EN_S  24
/* UART_RST_CORE : R/W ;bitpos:[23] ;default: 1'b0 ; */
/*description: Write 1 then write 0 to this bit, reset UART Tx/Rx..*/
#define UART_RST_CORE    (BIT(23))
#define UART_RST_CORE_M  (BIT(23))
#define UART_RST_CORE_V  0x1
#define UART_RST_CORE_S  23
/* UART_SCLK_EN : R/W ;bitpos:[22] ;default: 1'b1 ; */
/*description: Set this bit to enable UART Tx/Rx clock..*/
#define UART_SCLK_EN    (BIT(22))
#define UART_SCLK_EN_M  (BIT(22))
#define UART_SCLK_EN_V  0x1
#define UART_SCLK_EN_S  22
/* UART_SCLK_SEL : R/W ;bitpos:[21:20] ;default: 2'd3 ; */
/*description: UART clock source select. 1: 80Mhz, 2: 8Mhz, 3: XTAL..*/
#define UART_SCLK_SEL    0x00000003
#define UART_SCLK_SEL_M  ((UART_SCLK_SEL_V)<<(UART_SCLK_SEL_S))
#define UART_SCLK_SEL_V  0x3
#define UART_SCLK_SEL_S  20
/* UART_SCLK_DIV_NUM : R/W ;bitpos:[19:12] ;default: 8'h1 ; */
/*description: The integral part of the frequency divider factor..*/
#define UART_SCLK_DIV_NUM    0x000000FF
#define UART_SCLK_DIV_NUM_M  ((UART_SCLK_DIV_NUM_V)<<(UART_SCLK_DIV_NUM_S))
#define UART_SCLK_DIV_NUM_V  0xFF
#define UART_SCLK_DIV_NUM_S  12
/* UART_SCLK_DIV_A : R/W ;bitpos:[11:6] ;default: 6'h0 ; */
/*description: The numerator of the frequency divider factor..*/
#define UART_SCLK_DIV_A    0x0000003F
#define UART_SCLK_DIV_A_M  ((UART_SCLK_DIV_A_V)<<(UART_SCLK_DIV_A_S))
#define UART_SCLK_DIV_A_V  0x3F
#define UART_SCLK_DIV_A_S  6
/* UART_SCLK_DIV_B : R/W ;bitpos:[5:0] ;default: 6'h0 ; */
/*description: The  denominator of the frequency divider factor..*/
#define UART_SCLK_DIV_B    0x0000003F
#define UART_SCLK_DIV_B_M  ((UART_SCLK_DIV_B_V)<<(UART_SCLK_DIV_B_S))
#define UART_SCLK_DIV_B_V  0x3F
#define UART_SCLK_DIV_B_S  0

#define UART_DATE_REG(i)          (REG_UART_BASE(i) + 0x7C)
/* UART_DATE : R/W ;bitpos:[31:0] ;default: 32'h2008270 ; */
/*description: This is the version register..*/
#define UART_DATE    0xFFFFFFFF
#define UART_DATE_M  ((UART_DATE_V)<<(UART_DATE_S))
#define UART_DATE_V  0xFFFFFFFF
#define UART_DATE_S  0

#define UART_ID_REG(i)          (REG_UART_BASE(i) + 0x80)
/* UART_UPDATE : R/W/SC ;bitpos:[31] ;default: 1'b0 ; */
/*description: Software write 1 would synchronize registers into UART Core clock domain and wou
ld be cleared by hardware after synchronization is done..*/
#define UART_UPDATE    (BIT(31))
#define UART_UPDATE_M  (BIT(31))
#define UART_UPDATE_V  0x1
#define UART_UPDATE_S  31
/* UART_HIGH_SPEED : R/W ;bitpos:[30] ;default: 1'b1 ; */
/*description: This bit used to select synchronize mode. 1: Registers are auto synchronized int
o UART Core clock and UART core should be keep the same with APB clock. 0: After
 configure registers, software needs to write 1 to UART_REG_UPDATE to synchroniz
e registers..*/
#define UART_HIGH_SPEED    (BIT(30))
#define UART_HIGH_SPEED_M  (BIT(30))
#define UART_HIGH_SPEED_V  0x1
#define UART_HIGH_SPEED_S  30
/* UART_ID : R/W ;bitpos:[29:0] ;default: 30'h0500 ; */
/*description: This register is used to configure the uart_id..*/
#define UART_ID    0x3FFFFFFF
#define UART_ID_M  ((UART_ID_V)<<(UART_ID_S))
#define UART_ID_V  0x3FFFFFFF
#define UART_ID_S  0


#ifdef __cplusplus
}
#endif



#endif /*_SOC_UART_REG_H_ */
